{
  "backend/main.mo": "Motoko canister implementing habit CRUD, critical habit limits, scoring logic, and image blob storage integration.",
  "feature_evidence.json": "Metadata linking implemented features to source files, components, and test IDs for gallery sizing and image scaling.",
  "frontend-file-summaries.txt": "JSON mapping of frontend files to high-level descriptions used for build and feature planning.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root React component coordinating header, category selection, habit list, dialogs, gallery, and global layout.",
  "frontend/src/components/AddHabitButton.tsx": "Floating action button that opens the Add Habit dialog.",
  "frontend/src/components/AddHabitDialog.tsx": "Form dialog for creating a new habit with ratings, critical toggle enforcement, and category selection.",
  "frontend/src/components/CategoryToggle.tsx": "Two-button segmented switch for selecting between Performance and Aesthetics categories.",
  "frontend/src/components/DeleteHabitDialog.tsx": "Confirmation dialog for deleting a habit with loading feedback.",
  "frontend/src/components/EditHabitDialog.tsx": "Form dialog for editing an existing habit with pre-filled values and critical limit validation.",
  "frontend/src/components/Footer.tsx": "Footer with attribution text and link to caffeine.ai.",
  "frontend/src/components/GalleryButton.tsx": "Floating button with eye icon used to open the photo gallery dialog.",
  "frontend/src/components/HabitCard.tsx": "Expandable card showing habit details, score tier, and edit/delete dialogs.",
  "frontend/src/components/HabitList.tsx": "Fetches habits for a category and renders them as a ranked list of HabitCards.",
  "frontend/src/components/Header.tsx": "Editable header component that loads, displays, and saves a custom title.",
  "frontend/src/components/PhotoGallery.tsx": "Modal photo gallery with image upload, carousel navigation, and delete functionality.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor, handling identity changes and access control initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and persistent identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for habits and gallery operations using the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, typography, and custom utility/component classes for tiers and critical habit styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and sessionStorage parameters, including logic for hash‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, requirements, and a pending feature request focused on fixing the image viewer’s sizing and proportional scaling behavior."
}